Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData.ModelessManager
Modeless UI Manager
Add-ins which implements modeless UI dialogs can use this class in order to be notified
when selection was changed or when it can modify Revit document
Since:
2017

Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData.ConnectionId
The id of the structural connection element.
Since:
2017

Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData.Document
The current document.
Since:
2017

Autodesk.Revit.DB.Structure.ModifyConnectionParametersServiceData
The data needed by modify connection parameters server to view and modify structural connection parameters.
Remarks:
It's exposed in internal API.
Since:
2017